#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/cluster-dev/cluster]
module.eks.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_region.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.aws_lbc: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02d91c3a9623e633f]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.karpenter.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.karpenter.data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.eks_admins_iam_group.aws_iam_group.this[0]: Refreshing state... [id=eks-admin]
aws_iam_policy.aws_lbc: Refreshing state... [id=arn:aws:iam::509399618437:policy/AWSLoadBalancerController]
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.aws_lbc: Read complete after 0s [id=819195744]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Read complete after 0s [id=509399618437]
module.allow_eks_access_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/allow-eks-access]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-south-1]
aws_iam_policy.eks_admin: Refreshing state... [id=arn:aws:iam::509399618437:policy/AmazonEKSAdminPolicy]
data.aws_availability_zones.available: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
aws_iam_user.manager: Refreshing state... [id=manager]
module.user1_iam_user.aws_iam_user.this[0]: Refreshing state... [id=user1]
module.eks_admins_iam_group.data.aws_partition.current: Reading...
module.eks_admins_iam_group.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-20241123083737970400000002]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20241123083737814600000001]
aws_iam_role.aws_lbc: Refreshing state... [id=dev-aws-lbc]
module.karpenter.data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=cluster-dev-cluster-20241123083738034800000003]
module.eks.data.aws_iam_session_context.current: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Reading...
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=3966440753]
module.eks_admins_iam_group.aws_iam_group_membership.this[0]: Refreshing state... [id=eks-admin]
aws_iam_role_policy_attachment.aws_lbc: Refreshing state... [id=dev-aws-lbc-20241123083738193700000004]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::509399618437:assumed-role/aws-github-oidc/aws-github-oidc]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=509399618437]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-20241123083737970400000002-20241123083738312800000006]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-20241123083737970400000002-20241123083738348100000008]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-20241123083737970400000002-20241123083738339000000007]
data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
aws_iam_role.eks_admin: Refreshing state... [id=dev-eks-admin]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cluster-dev-cluster-20241123083738034800000003-20241123083738367300000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cluster-dev-cluster-20241123083738034800000003-2024112308373841700000000a]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2270560858]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=fb4ba6e1-f492-4cd8-9807-179a5abb437c]
aws_iam_role_policy_attachment.eks_admin: Refreshing state... [id=dev-eks-admin-20241123083738281600000005]
data.aws_availability_zones.available: Read complete after 0s [id=ap-south-1]
aws_iam_policy.eks_assume_admin: Refreshing state... [id=arn:aws:iam::509399618437:policy/AmazonEKSAssumeAdminPolicy]
aws_iam_user_policy_attachment.manager: Refreshing state... [id=manager-2024112308373846010000000b]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cluster-dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/cluster-dev-cluster-ClusterEncryption20241123083803969100000013]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cluster-dev-cluster-20241123083738034800000003-20241123083804271000000014]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-09aa7d7b365c1bf51]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0dabfc53abbccb1f4]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0254007fb46a93cef]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04d61d41fd10722c3]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=712609775]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0e9b4938b9c73700c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0296613d4446e18d5]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0a39e1a42674dea8c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07b042b0f6feb074a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-073c7b5a9d468ce5a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-083f6dadf54578475]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0a457e67932dab810]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-08f09632b06f0e85f]
module.eks_admins_iam_role.aws_iam_role.this[0]: Refreshing state... [id=eks-admin]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09bf232801c50c985]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07b042b0f6feb074a1080289494]
module.eks_admins_iam_role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-admin-20241123083755692100000010]
module.allow_assume_eks_admins_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/allow-assume-eks-admin-iam-role]
module.eks_admins_iam_group.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=eks-admin-20241123083756001500000012]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b0262cd70a4f959b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08f435cfdd8a5b7b1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04a111b816a498122]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e1ce9a3d8d9e2ffb]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1969909473]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-828595721]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1438805442]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3812299960]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2731618773]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3971781406]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1184780771]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3509964046]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2413573749]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-336553872]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1183992273]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09850d45a164b4c98]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0296613d4446e18d51080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=cluster-dev]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-11-23T08:46:34Z]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["terraform"]: Refreshing state... [id=sg-0f8d00a1aa88a61ce,terraform]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/aws-github-oidc]
module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"]: Refreshing state... [id=sg-0f8d00a1aa88a61ce,Owner]
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0f8d00a1aa88a61ce,Project]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0f8d00a1aa88a61ce,Environment]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8443261713034276845]
module.eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0de3b3c0370b96548]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cluster-dev#arn:aws:iam::509399618437:role/aws-github-oidc#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=8620fd676f1f5fb482fb77207743ac75042750fa]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::509399618437:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/834FA32ABCA6A36968CE3C9421FE02A1]
module.eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=cluster-dev:karpenter-20241123084643266500000024]
aws_eks_pod_identity_association.aws_lbc: Refreshing state... [id=a-jwlu8eoscbid3wtss]
aws_eks_access_entry.manager: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/dev-eks-admin]
data.aws_eks_cluster_auth.default: Reading...
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-2024112308460705220000001a]
data.aws_eks_cluster_auth.default: Read complete after 0s [id=cluster-dev]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-cluster-dev-2024112308460705830000001b]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-53zgfmtqqzwuxpjub]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20241123084607050200000017]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241123084607049400000016]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/509399618437/Karpenter-cluster-dev]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241123084607051200000019]
helm_release.updater: Refreshing state... [id=updater]
helm_release.argocd: Refreshing state... [id=argocd]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=Karpenter-cluster-dev-2024112308460705830000001b-2024112308460879150000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=Karpenter-cluster-dev-2024112308460705830000001b-2024112308460885350000001d]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=Karpenter-cluster-dev-2024112308460705830000001b-2024112308460887290000001e]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=Karpenter-cluster-dev-2024112308460705830000001b-2024112308460888820000001f]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=cluster-dev:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=cluster-dev:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=cluster-dev:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=cluster-dev:vpc-cni]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
helm_release.karpenter: Refreshing state... [id=karpenter]
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=221800040]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/509399618437/Karpenter-cluster-dev]
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=138282963]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-2024112308460705220000001a-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241123084607049400000016-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20241123084607050200000017-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241123084607051200000019-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=1088528959]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=1088528959]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/KarpenterController-20241123084636513600000022]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20241123083737814600000001-20241123084636808900000023]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/Karpenter-cluster-dev-2024112308460705830000001b]
kubectl_manifest.karpenter_node_class: Refreshing state... [id=/apis/karpenter.k8s.aws/v1beta1/ec2nodeclasses/default]
kubectl_manifest.karpenter_node_pool: Refreshing state... [id=/apis/karpenter.sh/v1beta1/nodepools/default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                global:
                  image:
                    tag: "v2.12.6"
                
                server:
                  extraArgs:
                    - --insecure
            EOT,
        ]
      + verify                     = false
      + version                    = "3.35.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.aws_lbc will be created
  + resource "helm_release" "aws_lbc" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.9.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "cluster-dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-02d91c3a9623e633f"
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                defaultArgs:
                  - --cert-dir=/tmp
                  - --kubelet-preferred-address-types=InternalIP,ExternalIP,Hostname
                  - --kubelet-use-node-status-port
                  - --metric-resolution=15s
                  - --secure-port=10250
            EOT,
        ]
      + verify                     = false
      + version                    = "3.12.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.updater is tainted, so must be replaced
-/+ resource "helm_release" "updater" {
      ~ id                         = "updater" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v0.12.2"
              - chart          = "argocd-image-updater"
              - first_deployed = 1732417837
              - last_deployed  = 1732417837
              - name           = "updater"
              - namespace      = "argocd"
              - revision       = 1
              - values         = jsonencode(
                    {
                      - image   = {
                          - tag = "v0.12.2"
                        }
                      - metrics = {
                          - enabled = true
                        }
                    }
                )
              - version        = "0.9.1"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        name                       = "updater"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @durga61, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform AWS infra creation`*